# Письмак Архип Юрійович КН-45-5(13 варіант)
# Програма для обчислення X залежно від a та b

a = float(input("Введіть a: "))
b = float(input("Введіть b: "))

# Перевірка умов
if a > b:
    if a == 0:
        print("Помилка: ділення на нуль у виразі b/a.")
    else:
        X = b / a + 61
        print("Значення X =", X)

elif a == b:
    X = -5
    print("Значення X =", X)

else:  # a < b
    if b == 0:
        print("Помилка: ділення на нуль у виразі (b - a)/b.")
    else:
        X = (b - a) / b
        print("Значення X =", X)
