# Письмак Архип Юрійович КН-45-5(13 варіант)
# Дано одномірний масив, що складається з N дійсних елементів. Масив користувач має ввести з клавіатури. Знайти мінімальний додатний елемент.


def read_positive_int(prompt: str) -> int:
    """
    Зчитує з клавіатури додатне ціле число.
    Повертає значення N, перевіряючи коректність введення.
    """
    while True:  # Повторюємо, поки користувач не введе коректне значення
        try:
            value = int(input(prompt).strip())
            if value <= 0:
                print("N має бути додатним цілим числом. Спробуйте ще раз.")
                continue
            return value
        except ValueError:
            print("Некоректне значення. Введіть додатне ціле число.")


def read_float_list(n: int) -> list[float]:
    """
    Зчитує рівно n дійсних чисел, введених у один рядок.
    Дозволяє використовувати як пробіли, так і коми як роздільники.
    Повертає список з n чисел типу float.
    """
    while True:
        raw = input(f"Введіть {n} дійсних чисел через пробіл: ").strip()
        # Замінюємо коми на пробіли для зручності введення: "1,2 3" -> "1 2 3"
        parts = raw.replace(',', ' ').split()
        if len(parts) != n:
            print(f"Потрібно ввести рівно {n} чисел. Ви ввели {len(parts)}. Спробуйте ще раз.")
            continue
        try:
            # Перетворюємо кожен фрагмент на дійсне число
            return [float(x) for x in parts]
        except ValueError:
            print("Зустрілося нечислове значення. Переконайтесь, що вводите лише числа.")


def find_min_positive(arr: list[float]):
    """Повертає мінімальний додатний елемент масиву або None, якщо таких немає."""
    # Відфільтровуємо лише додатні елементи (> 0)
    positives = [x for x in arr if x > 0]
    if not positives:
        # Якщо додатніх елементів немає, повертаємо None
        return None
    return min(positives)


def main():
    """Точка входу в програму: зчитування даних та вивід результату."""
    print("Завдання: Знайти мінімальний додатний елемент у масиві.")
    n = read_positive_int("Введіть довжину масиву N: ")
    arr = read_float_list(n)  # Зчитуємо рівно N чисел

    result = find_min_positive(arr)
    if result is None:
        print("У масиві немає додатних елементів.")
    else:
        print(f"Мінімальний додатний елемент: {result}")


if __name__ == "__main__":
    main()

